InformationRegisters/ЗамерыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗамерыОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метаданные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперативнаяПамять</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процессор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗамерыОперацийНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗамерыОперацийНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрироватьВРегистреСразу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокХраненияДанныхВРегистре</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЗамерыОперацийСервер/Ext/Module.bsl
Функция ПолучитьМассивЗамеров() Экспорт 
	
	Результат = ЗамерыОперацийОбщий.ПолучитьМассивЗамеров();
	Возврат Результат;
	
КонецФункции

Функция УстановитьМассивЗамеров(МассивЗамеров) Экспорт 
	
	ЗамерыОперацийОбщий.УстановитьМассивЗамеров(МассивЗамеров);
	Возврат Неопределено;
	
КонецФункции

Функция ЗарегистрироватьЗамер(ИмяОперации, Длительность, СсылкаОбъекта, ИмяКомпьютера, Комментарий) Экспорт 
	
	НастройкиЗамеров = ЗамерыОперацийКэшируемый.ПолучитьПараметрыЗамеровОпераций();
	Если СсылкаОбъекта <> Неопределено Тогда
		МетаданныеОбъекта = СсылкаОбъекта.Метаданные();
	КонецЕсли; 
	//Если НастройкиЗамеров.РегистрироватьВЖурналеРегистрации Тогда
	//	Разделитель = "^;^";
	//	//ЗаписьЖурналаРегистрации("КонтрольнаяОперация", УровеньЖурналаРегистрации.Предупреждение, МетаданныеОбъекта, СсылкаОбъекта,
	//	//	ИмяОперации + Разделитель + Формат(Длительность, "ЧГ=") + Разделитель + Комментарий, РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);   <<PSV>>
	//КонецЕсли; 
	Если НастройкиЗамеров.РегистрироватьВРегистре Тогда
		
		СистемнаяИнформация = ПолучитьСистемнуюИнформацию();
		#Если Не МобильноеПриложениеКлиент И Не МобильноеПриложениеСервер Тогда
			НомерСеанса = НомерСеансаИнформационнойБазы();
		#Иначе
			НомерСеанса = 0;
		#КонецЕсли	
		
		ПолноеИмяМетаданных = "";
		Если МетаданныеОбъекта <> Неопределено Тогда
			ПолноеИмяМетаданных = МетаданныеОбъекта.ПолноеИмя();
		КонецЕсли; 
		Если НастройкиЗамеров.ЭтоФайловаяБаза Тогда
			ЗамерыОперацийСервер.ЗаписатьЗамерВРегистр(ИмяОперации, Длительность, СсылкаОбъекта, ПолноеИмяМетаданных, ТекущаяДата(), ИмяКомпьютера, 
				СистемнаяИнформация.ВерсияОС, СистемнаяИнформация.ВерсияПриложения, СистемнаяИнформация.ОперативнаяПамять, СистемнаяИнформация.Процессор, НомерСеанса, Комментарий);
		Иначе
			ПараметрыВызова = Новый Массив;
			ПараметрыВызова.Добавить(ИмяОперации);
			ПараметрыВызова.Добавить(Длительность);
			ПараметрыВызова.Добавить(СсылкаОбъекта);
			ПараметрыВызова.Добавить(ПолноеИмяМетаданных);
			ПараметрыВызова.Добавить(ТекущаяДата());
			ПараметрыВызова.Добавить(ИмяКомпьютера);
			ПараметрыВызова.Добавить(СистемнаяИнформация.ВерсияОС);
			ПараметрыВызова.Добавить(СистемнаяИнформация.ВерсияПриложения);
			ПараметрыВызова.Добавить(СистемнаяИнформация.ОперативнаяПамять);
			ПараметрыВызова.Добавить(СистемнаяИнформация.Процессор);
			ПараметрыВызова.Добавить(НомерСеанса);
			ПараметрыВызова.Добавить(Комментарий);
			ФоновыеЗадания.Выполнить("ЗамерыОперацийСервер.ЗаписатьЗамерВРегистр", ПараметрыВызова, Новый УникальныйИдентификатор, "Фоновая регистрация замера операции");
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции
	
Функция ЗаписатьЗамерВРегистр(ИмяОперации, Длительность, СсылкаОбъекта, ПолноеИмяМетаданных, ДатаКонца, Компьютер, ВерсияОС, ВерсияПриложения, ОперативнаяПамять, Процессор, НомерСеанса, Комментарий) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЗамерыОпераций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаКонца = ДатаКонца;
	МенеджерЗаписи.ИмяОперации = ИмяОперации;
	МенеджерЗаписи.Данные = СсылкаОбъекта;
	МенеджерЗаписи.Метаданные = ПолноеИмяМетаданных;
	МенеджерЗаписи.Длительность = Длительность / 1000;
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь; 
	МенеджерЗаписи.Компьютер = Компьютер;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.ВерсияОС = ВерсияОС;
	МенеджерЗаписи.ВерсияПриложения = ВерсияПриложения;
	МенеджерЗаписи.ОперативнаяПамять = ОперативнаяПамять;
	МенеджерЗаписи.Процессор = Процессор;
	МенеджерЗаписи.НомерСеанса = НомерСеанса;
	
	Попытка
		МенеджерЗаписи.Записать(Ложь);
	Исключение
	КонецПопытки;
	
КонецФункции

Функция ЭтоФоновоеЗадание() Экспорт 

	//НомерСеанса = НомерСеансаИнформационнойБазы();
	//Сеансы = ПолучитьСеансыИнформационнойБазы();
	//Для Каждого Сеанс Из Сеансы Цикл
	//	Если Сеанс.НомерСеанса = НомерСеанса Тогда
	//		Результат = НРег(Сеанс.ИмяПриложения) = НРег("BackgroundJob");
	//		Прервать;
	//	КонецЕсли; 
	//КонецЦикла;
	//Возврат Результат;

	Возврат Ложь;
	
КонецФункции // ЭтоФоновоеЗадание()

Функция ПолучитьПараметрыЗамеровОпераций() Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЗамерыОперацийНастройки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		// заполним настройки по умолчанию 
		//МенеджерЗаписи.РегистрироватьВЖурналеРегистрации = Истина;
		МенеджерЗаписи.РегистрироватьВРегистреСразу = Истина;
		МенеджерЗаписи.СрокХраненияДанныхВРегистре = 30;
		//МенеджерЗаписи.РегистрироватьАвтозадания = Ложь;
		МенеджерЗаписи.Записать();
	КонецЕсли; 
	Настройки = Новый Структура;
	Настройки.Вставить("ЭтоФоновоеЗадание", ЭтоФоновоеЗадание());
	Настройки.Вставить("ЭтоФайловаяБаза", Истина);//Не ПустаяСтрока(НСтр(СтрокаСоединенияИнформационнойБазы(), "File")));  <<PSV>>
	//Настройки.Вставить("РегистрироватьВЖурналеРегистрации", МенеджерЗаписи.РегистрироватьВЖурналеРегистрации);
	Настройки.Вставить("РегистрироватьВРегистре", МенеджерЗаписи.РегистрироватьВРегистреСразу);
	Настройки.Вставить("СрокХраненияДанныхВРегистре", МенеджерЗаписи.СрокХраненияДанныхВРегистре);
	Настройки.Вставить("ЗамерыВключены", Ложь
		//Или МенеджерЗаписи.РегистрироватьВЖурналеРегистрации
		Или МенеджерЗаписи.РегистрироватьВРегистреСразу);
	//Настройки.Вставить("РегистрироватьАвтозадания", МенеджерЗаписи.РегистрироватьАвтозадания);
	Возврат Настройки;
	
КонецФункции 

Функция ПолучитьСистемнуюИнформацию() Экспорт
	
	СисИнфо = Новый СистемнаяИнформация;	
	
	Возврат СисИнфо;
	
КонецФункции
